k6/findPath/smoke.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: smoke.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 40s max duration (incl. graceful stop):
           * default: 1 looping VUs for 10s (gracefulStop: 30s)

WARN[0000] error getting terminal size                   error="The handle is invalid."

running (10.1s), 0/1 VUs, 9 complete and 0 interrupted iterations
default ✓ [======================================] 1 VUs  10s

     ✓ find path

     checks.........................: 100.00% ✓ 9        ✗ 0
     data_received..................: 31 kB   3.0 kB/s
     data_sent......................: 1.3 kB  130 B/s
     http_req_blocked...............: avg=1.22ms   min=0s       med=0s      max=11.05ms  p(90)=2.21ms   p(95)=6.63ms
     http_req_connecting............: avg=332.25µs min=0s       med=0s      max=2.99ms   p(90)=598.06µs p(95)=1.79ms
   ✓ http_req_duration..............: avg=118.74ms min=113.64ms med=116.9ms max=127.29ms p(90)=126.84ms p(95)=127.07ms
       { expected_response:true }...: avg=118.74ms min=113.64ms med=116.9ms max=127.29ms p(90)=126.84ms p(95)=127.07ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 9
     http_req_receiving.............: avg=341.01µs min=0s       med=0s      max=1.03ms   p(90)=1.02ms   p(95)=1.03ms
     http_req_sending...............: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=118.4ms  min=113ms    med=116.9ms max=127.29ms p(90)=126.02ms p(95)=126.65ms
     http_reqs......................: 9       0.886929/s
     iteration_duration.............: avg=1.12s    min=1.11s    med=1.12s   max=1.15s    p(90)=1.13s    p(95)=1.14s
     iterations.....................: 9       0.886929/s
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1